{
  "_name_or_path": "bert-base-uncased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "ARTS",
    "1": "ARTS & CULTURE",
    "2": "BLACK VOICES",
    "3": "BUSINESS",
    "4": "COLLEGE",
    "5": "COMEDY",
    "6": "CRIME",
    "7": "CULTURE & ARTS",
    "8": "DIVORCE",
    "9": "EDUCATION",
    "10": "ENTERTAINMENT",
    "11": "ENVIRONMENT",
    "12": "FIFTY",
    "13": "FOOD & DRINK",
    "14": "GOOD NEWS",
    "15": "GREEN",
    "16": "HEALTHY LIVING",
    "17": "HOME & LIVING",
    "18": "IMPACT",
    "19": "LATINO VOICES",
    "20": "MEDIA",
    "21": "MONEY",
    "22": "PARENTING",
    "23": "PARENTS",
    "24": "POLITICS",
    "25": "QUEER VOICES",
    "26": "RELIGION",
    "27": "SCIENCE",
    "28": "SPORTS",
    "29": "STYLE",
    "30": "STYLE & BEAUTY",
    "31": "TASTE",
    "32": "TECH",
    "33": "THE WORLDPOST",
    "34": "TRAVEL",
    "35": "U.S. NEWS",
    "36": "WEDDINGS",
    "37": "WEIRD NEWS",
    "38": "WELLNESS",
    "39": "WOMEN",
    "40": "WORLD NEWS",
    "41": "WORLDPOST"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "ARTS": 0,
    "ARTS & CULTURE": 1,
    "BLACK VOICES": 2,
    "BUSINESS": 3,
    "COLLEGE": 4,
    "COMEDY": 5,
    "CRIME": 6,
    "CULTURE & ARTS": 7,
    "DIVORCE": 8,
    "EDUCATION": 9,
    "ENTERTAINMENT": 10,
    "ENVIRONMENT": 11,
    "FIFTY": 12,
    "FOOD & DRINK": 13,
    "GOOD NEWS": 14,
    "GREEN": 15,
    "HEALTHY LIVING": 16,
    "HOME & LIVING": 17,
    "IMPACT": 18,
    "LATINO VOICES": 19,
    "MEDIA": 20,
    "MONEY": 21,
    "PARENTING": 22,
    "PARENTS": 23,
    "POLITICS": 24,
    "QUEER VOICES": 25,
    "RELIGION": 26,
    "SCIENCE": 27,
    "SPORTS": 28,
    "STYLE": 29,
    "STYLE & BEAUTY": 30,
    "TASTE": 31,
    "TECH": 32,
    "THE WORLDPOST": 33,
    "TRAVEL": 34,
    "U.S. NEWS": 35,
    "WEDDINGS": 36,
    "WEIRD NEWS": 37,
    "WELLNESS": 38,
    "WOMEN": 39,
    "WORLD NEWS": 40,
    "WORLDPOST": 41
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.33.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
